Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E06B.tmx
Source language: en_us
Languages: zh_cn

source: How to make a lamb mobile
zh_cn: 复活节玩具动手做之小羊羔

source: Make a lamb mobile with Maggy Woodley from Red Ted Art, in the fourth of our series of simple Easter crafts to make with children
zh_cn: Red Ted Art栏目的Maggy Woodley在动手做复活节儿童玩具系列中教大家做第四个玩具：小羊羔。

source: In many countries, lambs are a symbol of Easter- and they certainly are a symbol of spring.
zh_cn: 在很多国家，羊羔是复活节的象征——它们象征的春天。

source: We love these little lambs as they are quick and easy to make.
zh_cn: 我们很喜爱这些小羊羔，它们也很容易制作。

source: You can make them in all sorts of colours and, if you so wish, assemble them to make a mobile.
zh_cn: 你可以把它们做成各种颜色的，如果你愿意的话，也可以把它们做成可以走动的。

source: My son currently wants to make one a day!
zh_cn: 我儿子最近就花了一天做了一个。

source: Materials
zh_cn: 材料：

source: Card stock (white or black is ideal, but any colour is fine), cotton wool, glue, scissors and a pen
zh_cn: 纸板（最好是黑色或者白色的，别的颜色也可以），棉花，胶水，剪刀和笔。

source: Method
zh_cn: 步骤

source: This lamb comes in three parts: the body, legs and tail are one part and the head is made in two parts.
zh_cn: 羊羔由三部分组成：身体、腿和尾巴是一体的，头由两部分组成。

source: Fold your card in half.
zh_cn: 把纸板对折。

source: Draw on a body, legs and tail - then cut.
zh_cn: 画出身体、腿和尾巴，然后剪下它们。

source: The fold forms the back of the lamb and runs all along the tail.
zh_cn: 对折的纸板就构成了羊羔的背和尾巴。

source: Cut out two oval shapes for the head and glue on- part of each oval will be glued to the body, the other part to the second oval.
zh_cn: 剪出两个椭圆形用来做头部，再把它们粘起来——每个椭圆的一端粘连在身体上，另一端则和另一个椭圆粘起来。

source: This gives the lamb a little structure and prevents the legs from spreading out too far.
zh_cn: 这就形成了羊羔的主题结构，还能防止羊羔的腿伸展的太远。

source: Stick on lots of cotton wool (my son's favourite bit).
zh_cn: 把足量的棉花粘上去（我儿子爱死这一步了）。

source: Draw on eyes, ears and a mouth.
zh_cn: 画出眼、耳朵和嘴。

source: Hang with some cotton or a ribbon or just play with them (we do).
zh_cn: 系上棉布、丝带，或者就直接开完吧（我们就是这么做的）。
